app/controllers/drawings_controller.rb

  def index
    @drawings = Drawing.all
---
SELECT "drawings".* FROM "drawings"

    def set_drawing
      @drawing = Drawing.find(params[:id])
---
SELECT  "drawings".* FROM "drawings" WHERE "drawings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]