app/controllers/ellie_dee_controller.rb

  def index
    @drawing = Drawing.find_by_name("EllieDee")
    @drawings = Drawing.all
---
SELECT "drawings".* FROM "drawings"