app/views/ellie_dee/index.html.erb

SELECT "drawings".* FROM "drawings"
---
                    <% if user_signed_in? %>
                      <% current_user.drawings.each do |drawing| %>